Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack-integration/COMPONENT_HCI-UART/freertos/cybt_platform_freertos.c
/***************************************************************************//**
* \file cybt_platform_freertos.c
*
* \brief
* Implementation for BT porting interface on FreeRTOS
*
********************************************************************************
* \copyright
* Copyright 2018-2021 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <stdarg.h>

#include "wiced_data_types.h"

#include "cycfg.h"
#include "cyhal_uart.h"
#include "cyhal_gpio.h"
#include "cyhal_lptimer.h"
#include "cyhal_syspm.h"

#include "cybt_platform_task.h"
#include "cybt_platform_interface.h"
#include "cybt_platform_trace.h"
#include "cybt_platform_config.h"
#include "cybt_platform_util.h"
#ifdef ENABLE_DEBUG_UART
#include "cybt_debug_uart.h"
#endif // ENABLE_DEBUG_UART

/******************************************************************************
 *                                Constants
 ******************************************************************************/
#define HCI_SEMAPHORE_MAX_COUNT  (1)
#define HCI_SEMAPHORE_INIT_COUNT (0)

#if( configUSE_TICKLESS_IDLE != 0 )
#define PLATFORM_SLEEP_IDLE_TIMEOUT_MS     (3000)

#define SLEEP_TASK_NAME               "sleep_task"
#define SLEEP_TASK_STACK_SIZE         (1024)
#define SLEEP_TASK_PRIORITY           (CY_RTOS_PRIORITY_REALTIME)
#define SLEEP_TASK_QUEUE_COUNT        (32)
#define SLEEP_TASK_QUEUE_ITEM_SIZE    (sizeof(uint8_t))

#define SLEEP_ACT_START_IDLE_TIMER    (0x20)
#define SLEEP_ACT_STOP_IDLE_TIMER     (0x40)
#define SLEEP_ACT_EXIT_SLEEP_TASK     (0xFF)
#endif
/*****************************************************************************
 *                           Type Definitions
 *****************************************************************************/
#if( configUSE_TICKLESS_IDLE != 0 )
typedef uint8_t sleep_action_t;
#endif

typedef struct
{
    bool            inited;
    cyhal_uart_t    hal_obj;
    cy_semaphore_t  tx_complete;
    cy_semaphore_t  rx_complete;
    cy_mutex_t      tx_atomic;
    cy_mutex_t      rx_atomic;
} hci_uart_cb_t;


/******************************************************************************
 *                           Variables Definitions
 ******************************************************************************/
hci_uart_cb_t   hci_uart_cb;

#if( configUSE_TICKLESS_IDLE != 0 )
// This timer is only used in active mode,
// hence it's implemented by cy_rtos_timer API .
cy_timer_t      platform_sleep_idle_timer;
bool            platform_sleep_lock = false;

cy_thread_t     sleep_timer_task;
cy_queue_t      sleep_timer_task_queue;
#endif

cyhal_lptimer_t bt_stack_lptimer;
uint8_t         lptimer_freq_shift;


/******************************************************************************
 *                          Function Declarations
 ******************************************************************************/
#if( configUSE_TICKLESS_IDLE != 0 )
void cybt_idle_timer_cback(cy_timer_callback_arg_t arg);

cybt_result_t cybt_send_action_to_sleep_task(sleep_action_t action);
void cybt_sleep_timer_task(cy_thread_arg_t arg);
#endif

/******************************************************************************
 *                           Function Definitions
 ******************************************************************************/
uint8_t calculate_lptimer_freq_shift(uint32_t clock_freq)
{
    uint8_t idx;

    for (idx = 31; idx > 0; idx--)
    {
        if ((1U << idx) == clock_freq)
        {
            return idx;
        }
    }

    return 0;
}

void platform_stack_lptimer_cback(void *callback_arg, cyhal_lptimer_event_t event)
{
    cybt_platform_sleep_lock();

    cybt_send_msg_to_hci_rx_task(BT_IND_TO_BTS_TIMER, true);

    cybt_platform_sleep_unlock();
}


void *cybt_platform_malloc(uint32_t req_size)
{
    return malloc((size_t) req_size);
}

void cybt_platform_free(void *p_mem_block)
{
    free(p_mem_block);
}

void cybt_platform_disable_irq(void)
{
    __disable_irq();
}

void cybt_platform_enable_irq(void)
{
    __enable_irq();
}

void cybt_platform_init(void)
{
#if( configUSE_TICKLESS_IDLE != 0 )
    cy_rtos_init_timer(&platform_sleep_idle_timer,
                       CY_TIMER_TYPE_ONCE,
                       cybt_idle_timer_cback,
                       0
                      );
    MAIN_TRACE_DEBUG("cybt_platform_init(): platform_sleep_idle_timer = 0x%x", &platform_sleep_idle_timer);
#endif
    memset(&hci_uart_cb, 0, sizeof(hci_uart_cb_t));
    
    cyhal_lptimer_init(&bt_stack_lptimer);
    cyhal_lptimer_enable_event(&bt_stack_lptimer,
                               CYHAL_LPTIMER_COMPARE_MATCH,
                               CYHAL_ISR_PRIORITY_DEFAULT,
                               false
                              );
    cyhal_lptimer_register_callback(&bt_stack_lptimer, &platform_stack_lptimer_cback, NULL);
    cyhal_lptimer_enable_event(&bt_stack_lptimer,
                               CYHAL_LPTIMER_COMPARE_MATCH,
                               CYHAL_ISR_PRIORITY_DEFAULT,
                               true
                              );

    lptimer_freq_shift = calculate_lptimer_freq_shift(CY_CFG_SYSCLK_CLKLF_FREQ_HZ);

#if( configUSE_TICKLESS_IDLE != 0 )
    cy_rtos_init_queue(&sleep_timer_task_queue,
                       SLEEP_TASK_QUEUE_COUNT,
                       SLEEP_TASK_QUEUE_ITEM_SIZE
                      );

