Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack-integration/COMPONENT_HCI-UART/freertos/cybt_platform_freertos.c
    cy_rtos_create_thread(&sleep_timer_task,
                          cybt_sleep_timer_task,
                          SLEEP_TASK_NAME,
                          NULL,
                          SLEEP_TASK_STACK_SIZE,
                          SLEEP_TASK_PRIORITY,
                          (cy_thread_arg_t) 0
                         );
#endif
}

void cybt_platform_deinit(void)
{
    MAIN_TRACE_DEBUG("cybt_platform_deinit()");

#if( configUSE_TICKLESS_IDLE != 0 )
    cybt_send_action_to_sleep_task(SLEEP_ACT_EXIT_SLEEP_TASK);
#endif

    cyhal_lptimer_free(&bt_stack_lptimer);

#if( configUSE_TICKLESS_IDLE != 0 )
    cy_rtos_deinit_timer(&platform_sleep_idle_timer);
#endif
}

void cybt_platform_sleep_lock(void)
{
#if( configUSE_TICKLESS_IDLE != 0 )
    cybt_platform_disable_irq();

    if(false == platform_sleep_lock)
    {
        cyhal_syspm_lock_deepsleep();

        platform_sleep_lock = true;
    }

    cybt_send_action_to_sleep_task(SLEEP_ACT_STOP_IDLE_TIMER);
    cybt_platform_enable_irq();
#endif
}

void cybt_platform_sleep_unlock(void)
{
#if( configUSE_TICKLESS_IDLE != 0 )
    cybt_platform_disable_irq();

    if(true == platform_sleep_lock)
    {
        cybt_send_action_to_sleep_task(SLEEP_ACT_START_IDLE_TIMER);
        cybt_platform_enable_irq();
    }
    else
    {
        cybt_platform_enable_irq();
    }
#endif
}

uint64_t cybt_platform_get_tick_count_us(void)
{
    static uint64_t   abs_tick_cnt_hi = 0;
    static uint32_t   last_tick_cnt = 0;
    static uint64_t   lptick_remainder = 0;

    uint32_t          cur_time_in_lpticks = 0;
    uint64_t          cur_time_in_lpticks64 = 0;
    uint64_t          cur_time_in_us = 0;
    uint64_t          temp_cnt64 = 0;

    cur_time_in_lpticks = cyhal_lptimer_read(&bt_stack_lptimer);

    if (cur_time_in_lpticks < last_tick_cnt)
    {
        abs_tick_cnt_hi += 0x100000000;
    }

    last_tick_cnt = cur_time_in_lpticks;
    cur_time_in_lpticks64 = cur_time_in_lpticks + abs_tick_cnt_hi;

    // convert tick to us
    temp_cnt64 = cur_time_in_lpticks64 * 1000000;
    cur_time_in_us = temp_cnt64 >> lptimer_freq_shift;

    lptick_remainder += temp_cnt64 - (cur_time_in_us << lptimer_freq_shift);
    if(lptick_remainder > CY_CFG_SYSCLK_CLKLF_FREQ_HZ)
    {
        cur_time_in_us += 1;
        lptick_remainder -= CY_CFG_SYSCLK_CLKLF_FREQ_HZ;
    }

    return cur_time_in_us;
}

void cybt_platform_set_next_timeout(uint64_t abs_tick_us_to_expire)
{
    uint64_t curr_time_in_us = cybt_platform_get_tick_count_us();
    uint64_t time_to_expire_in_us = abs_tick_us_to_expire - curr_time_in_us;
    uint32_t time_to_expire_in_lpticks;

    if(abs_tick_us_to_expire <= curr_time_in_us)
    {
        // Already expired...
        cybt_send_msg_to_hci_rx_task(BT_IND_TO_BTS_TIMER, true);

        return;
    }

    // convert us to tick
    time_to_expire_in_lpticks = ((time_to_expire_in_us << lptimer_freq_shift) + 1000000 - 1) / 1000000;

    cyhal_lptimer_set_delay(&bt_stack_lptimer, time_to_expire_in_lpticks);
}

void cybt_platform_log_print(const char *fmt_str, ...)
{
    char buffer[CYBT_TRACE_BUFFER_SIZE];
    va_list ap;
    int len;
    cy_time_t time;

    cy_rtos_get_time(&time);
    va_start(ap, fmt_str);
    len = vsnprintf(buffer, CYBT_TRACE_BUFFER_SIZE, fmt_str, ap);
    va_end(ap);

#ifdef ENABLE_DEBUG_UART
    cybt_debug_uart_send_trace(len, (uint8_t*)buffer);
#else // ENABLE_DEBUG_UART
    printf("[%u] %s\r\n", (unsigned int)time, buffer);
    UNUSED_VARIABLE(len);
#endif // ENABLE_DEBUG_UART
}

static void cybt_uart_rx_not_empty(void)
{
    cyhal_uart_enable_event(&hci_uart_cb.hal_obj,
                            CYHAL_UART_IRQ_RX_NOT_EMPTY,
                            CYHAL_ISR_PRIORITY_DEFAULT,
                            false
                           );

    cybt_send_msg_to_hci_rx_task(BT_IND_TO_HCI_DATA_READY_UNKNOWN, true);
}

uint32_t uart_tx_done_cnt = 0;
static void cybt_uart_tx_done_irq(void)
{
    cy_rtos_set_semaphore(&hci_uart_cb.tx_complete, true);
}

static void cybt_uart_rx_done_irq(void)
{
    cy_rtos_set_semaphore(&hci_uart_cb.rx_complete, true);
}

static void cybt_uart_irq_handler(void *handler_arg, cyhal_uart_event_t event)
{
    switch(event)
    {
        case CYHAL_UART_IRQ_RX_NOT_EMPTY:
            cybt_uart_rx_not_empty();
            break;
        case CYHAL_UART_IRQ_TX_DONE:
            cybt_uart_tx_done_irq();
            break;
        case CYHAL_UART_IRQ_RX_DONE:
            cybt_uart_rx_done_irq();
            break;
        default:
            break;
    }
}

void cybt_platform_assert_bt_wake(void)
{
    if(true == cybt_platform_get_sleep_mode_status())
    {
        bool wake_polarity;
        const cybt_platform_config_t *p_bt_platform_cfg = cybt_platform_get_config();

        switch(p_bt_platform_cfg->controller_config.sleep_mode.device_wake_polarity)
        {
            case CYBT_WAKE_ACTIVE_LOW:
                wake_polarity = false;
                break;
            case CYBT_WAKE_ACTIVE_HIGH:
                wake_polarity = true;
                break;
            default:
                HCIDRV_TRACE_ERROR("ASSERT_BT_WAKE: unknown polarity (%d)",
                                   p_bt_platform_cfg->controller_config.sleep_mode.device_wake_polarity
                                  );
                return;
        }

        cyhal_gpio_write(p_bt_platform_cfg->controller_config.sleep_mode.device_wakeup_pin,
                         wake_polarity
                        );
    }
}

void cybt_platform_deassert_bt_wake(void)
{
    if(true == cybt_platform_get_sleep_mode_status())
    {
        bool sleep_polarity;
        const cybt_platform_config_t *p_bt_platform_cfg = cybt_platform_get_config();

        switch(p_bt_platform_cfg->controller_config.sleep_mode.device_wake_polarity)
        {
            case CYBT_WAKE_ACTIVE_LOW:
                sleep_polarity = true;
                break;
            case CYBT_WAKE_ACTIVE_HIGH:
                sleep_polarity = false;
                break;
            default:
                HCIDRV_TRACE_ERROR("DEASSERT_BT_WAKE: unknown polarity (%d)",
                                   p_bt_platform_cfg->controller_config.sleep_mode.device_wake_polarity
                                  );
                return;
        }

        cyhal_gpio_write(p_bt_platform_cfg->controller_config.sleep_mode.device_wakeup_pin,
                         sleep_polarity
                        );
    }
}


void cybt_host_wake_irq_handler(void *callback_arg, cyhal_gpio_event_t event)
{
    const cybt_platform_config_t *p_bt_platform_cfg = cybt_platform_get_config();

    switch(event)
    {
        case CYHAL_GPIO_IRQ_RISE:
            if(CYBT_WAKE_ACTIVE_HIGH == p_bt_platform_cfg->controller_config.sleep_mode.host_wake_polarity)
            {
                cybt_platform_sleep_lock();
            }
            else
            {
                cybt_platform_sleep_unlock();
            }
            break;
        case CYHAL_GPIO_IRQ_FALL:
            if(CYBT_WAKE_ACTIVE_LOW == p_bt_platform_cfg->controller_config.sleep_mode.host_wake_polarity)
            {
                cybt_platform_sleep_lock();
            }
            else
            {
                cybt_platform_sleep_unlock();
            }
            break;
        default:
            break;
    }
}

cybt_result_t cybt_platform_hci_open(void *p_arg)
{
    cyhal_uart_event_t enable_irq_event = (cyhal_uart_event_t)(CYHAL_UART_IRQ_RX_DONE
                                           | CYHAL_UART_IRQ_TX_DONE
                                           | CYHAL_UART_IRQ_RX_NOT_EMPTY
                                          );
    uint32_t actual_baud_rate;
    cy_rslt_t result;
    cyhal_uart_cfg_t bt_uart_cfg = {0};
    UNUSED_VARIABLE(p_arg);
    const cybt_platform_config_t *p_bt_platform_cfg = cybt_platform_get_config();

    if(true == hci_uart_cb.inited)
    {
        return  CYBT_SUCCESS;
    }

