Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack-integration/COMPONENT_HCI-UART/freertos/cybt_platform_freertos.c
    memset(&hci_uart_cb, 0, sizeof(hci_uart_cb_t));

    cy_rtos_init_semaphore(&hci_uart_cb.tx_complete,
                           HCI_SEMAPHORE_MAX_COUNT,
                           HCI_SEMAPHORE_INIT_COUNT
                          );
    cy_rtos_init_semaphore(&hci_uart_cb.rx_complete,
                           HCI_SEMAPHORE_MAX_COUNT,
                           HCI_SEMAPHORE_INIT_COUNT
                          );
    cy_rtos_init_mutex(&hci_uart_cb.tx_atomic);
    cy_rtos_init_mutex(&hci_uart_cb.rx_atomic);

#if( configUSE_TICKLESS_IDLE != 0 )
    if((CYBT_SLEEP_MODE_ENABLED == p_bt_platform_cfg->controller_config.sleep_mode.sleep_mode_enabled)
      && (NC != p_bt_platform_cfg->controller_config.sleep_mode.host_wakeup_pin))
    {
        result = cyhal_gpio_init(p_bt_platform_cfg->controller_config.sleep_mode.host_wakeup_pin,
                                 CYHAL_GPIO_DIR_INPUT,
                                 CYHAL_GPIO_DRIVE_NONE,
                                 0
                                );
        if(CY_RSLT_SUCCESS != result)
        {
            HCIDRV_TRACE_ERROR("hci_open(): Init HostWakeup pin failed (0x%x)",
                               result
                              );
            return CYBT_ERR_GPIO_HOST_WAKE_INIT_FAILED;
        }
    }

    if((CYBT_SLEEP_MODE_ENABLED == p_bt_platform_cfg->controller_config.sleep_mode.sleep_mode_enabled)
       && (NC != p_bt_platform_cfg->controller_config.sleep_mode.device_wakeup_pin)
       && (NC != p_bt_platform_cfg->controller_config.sleep_mode.host_wakeup_pin)
      )
    {
        if(CYBT_WAKE_ACTIVE_HIGH != p_bt_platform_cfg->controller_config.sleep_mode.host_wake_polarity
           && CYBT_WAKE_ACTIVE_LOW != p_bt_platform_cfg->controller_config.sleep_mode.host_wake_polarity
          )
        {
            HCIDRV_TRACE_ERROR("hci_open(): Unknown host wake polarity(%d)",
                               p_bt_platform_cfg->controller_config.sleep_mode.host_wake_polarity
                              );
            return  CYBT_ERR_GENERIC;
        }

#if (CYHAL_API_VERSION >= 2)
        static cyhal_gpio_callback_data_t cb_data = { .callback = cybt_host_wake_irq_handler, .callback_arg = NULL };
        cyhal_gpio_register_callback(p_bt_platform_cfg->controller_config.sleep_mode.host_wakeup_pin,
                                     &cb_data
                                    );
#else
        cyhal_gpio_register_callback(p_bt_platform_cfg->controller_config.sleep_mode.host_wakeup_pin,
                                     cybt_host_wake_irq_handler,
                                     NULL
                                    );
#endif
        cyhal_gpio_enable_event(p_bt_platform_cfg->controller_config.sleep_mode.host_wakeup_pin,
                                CYHAL_GPIO_IRQ_BOTH,
                                CYHAL_ISR_PRIORITY_DEFAULT,
                                true
                               );
    }
#endif

    if((CYBT_SLEEP_MODE_ENABLED == p_bt_platform_cfg->controller_config.sleep_mode.sleep_mode_enabled)
        && (NC != p_bt_platform_cfg->controller_config.sleep_mode.device_wakeup_pin))
    {
        result = cyhal_gpio_init(p_bt_platform_cfg->controller_config.sleep_mode.device_wakeup_pin,
                                 CYHAL_GPIO_DIR_OUTPUT,
                                 CYHAL_GPIO_DRIVE_STRONG,
                                 0
                                );
        if(CY_RSLT_SUCCESS != result)
        {
            HCIDRV_TRACE_ERROR("hci_open(): Init DevWakeup pin failed (0x%x)",
                               result
                              );
            return CYBT_ERR_GPIO_DEV_WAKE_INIT_FAILED;
        }

        cyhal_gpio_write(p_bt_platform_cfg->controller_config.sleep_mode.device_wakeup_pin,
                         false
                        );
        cy_rtos_delay_milliseconds(100);
    }

    result = cyhal_gpio_init(p_bt_platform_cfg->controller_config.bt_power_pin,
                             CYHAL_GPIO_DIR_OUTPUT,
                             CYHAL_GPIO_DRIVE_PULLUP,
                             1
                            );
    if(CY_RSLT_SUCCESS != result)
    {
        HCIDRV_TRACE_ERROR("hci_open(): Init power pin failed (0x%x)",
                           result
                          );
        return CYBT_ERR_GPIO_POWER_INIT_FAILED;
    }

    cyhal_gpio_write(p_bt_platform_cfg->controller_config.bt_power_pin,
                     true
                    );
    cy_rtos_delay_milliseconds(500);

    bt_uart_cfg.data_bits = p_bt_platform_cfg->hci_config.hci.hci_uart.data_bits;
    bt_uart_cfg.stop_bits = p_bt_platform_cfg->hci_config.hci.hci_uart.stop_bits;
    bt_uart_cfg.parity = p_bt_platform_cfg->hci_config.hci.hci_uart.parity;
    bt_uart_cfg.rx_buffer = NULL;
    bt_uart_cfg.rx_buffer_size = 0;

#if (CYHAL_API_VERSION >= 2)
    result = cyhal_uart_init(&hci_uart_cb.hal_obj,
                             p_bt_platform_cfg->hci_config.hci.hci_uart.uart_tx_pin,
                             p_bt_platform_cfg->hci_config.hci.hci_uart.uart_rx_pin,
                             p_bt_platform_cfg->hci_config.hci.hci_uart.uart_cts_pin,
                             p_bt_platform_cfg->hci_config.hci.hci_uart.uart_rts_pin,
                             NULL,
                             &bt_uart_cfg
                            );
#else
    result = cyhal_uart_init(&hci_uart_cb.hal_obj,
                             p_bt_platform_cfg->hci_config.hci.hci_uart.uart_tx_pin,
                             p_bt_platform_cfg->hci_config.hci.hci_uart.uart_rx_pin,
                             NULL,
                             &bt_uart_cfg
                            );
#endif
    if(CY_RSLT_SUCCESS != result)
    {
        HCIDRV_TRACE_ERROR("hci_open(): init error (0x%x)", result);
        return  CYBT_ERR_HCI_INIT_FAILED;
    }

    result = cyhal_uart_set_baud(&hci_uart_cb.hal_obj,
                                 HCI_UART_DEFAULT_BAUDRATE,
                                 &actual_baud_rate
                                );
    if(CY_RSLT_SUCCESS != result)
    {
        HCIDRV_TRACE_ERROR("hci_open(): Set baud rate failed (0x%x)",
                           result
                          );
        return  CYBT_ERR_HCI_SET_BAUDRATE_FAILED;
    }
    HCIDRV_TRACE_DEBUG("hci_open(): act baud rate  = %d", actual_baud_rate);

