Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack-integration/COMPONENT_HCI-UART/freertos/cybt_platform_freertos.c
    if(true == p_bt_platform_cfg->hci_config.hci.hci_uart.flow_control)
    {
    #if (CYHAL_API_VERSION >= 2)
        result = cyhal_uart_enable_flow_control(&hci_uart_cb.hal_obj, true, true);
    #else
        result = cyhal_uart_set_flow_control(&hci_uart_cb.hal_obj,
                                            p_bt_platform_cfg->hci_config.hci.hci_uart.uart_cts_pin,
                                            p_bt_platform_cfg->hci_config.hci.hci_uart.uart_rts_pin
                                           );
    #endif
        if(CY_RSLT_SUCCESS != result)
        {
            HCIDRV_TRACE_ERROR("hci_open(): Set flow control failed (0x%x)",
                               result
                              );
            return  CYBT_ERR_HCI_SET_FLOW_CTRL_FAILED;
        }
    }

    cyhal_uart_register_callback(&hci_uart_cb.hal_obj,
                                 cybt_uart_irq_handler,
                                 NULL
                                );

    cyhal_uart_enable_event(&hci_uart_cb.hal_obj,
                            enable_irq_event,
                            CYHAL_ISR_PRIORITY_DEFAULT,
                            true
                           );

    HCIDRV_TRACE_DEBUG("hci_open(): Wait CTS low");
    while(true == cyhal_gpio_read(p_bt_platform_cfg->hci_config.hci.hci_uart.uart_cts_pin))
    {
        cy_rtos_delay_milliseconds(10);
    }

    hci_uart_cb.inited = true;

    HCIDRV_TRACE_DEBUG("hci_open(): Done");

    return  CYBT_SUCCESS;
}

cybt_result_t cybt_platform_hci_set_baudrate(uint32_t baudrate)
{
    uint32_t actual_baud;
    cy_rslt_t result = cyhal_uart_set_baud(&hci_uart_cb.hal_obj, baudrate, &actual_baud);

    if(false == hci_uart_cb.inited)
    {
        HCIDRV_TRACE_ERROR("set_baudrate(): UART is NOT initialized");
        return  CYBT_ERR_HCI_NOT_INITIALIZE;
    }

    if(CY_RSLT_SUCCESS == result)
    {
        HCIDRV_TRACE_DEBUG("set_baudrate(): SUCCESS, req = %d, actual = %d",
                           baudrate,
                           actual_baud
                          );
        return  CYBT_SUCCESS;
    }
    else
    {
        HCIDRV_TRACE_ERROR("set_baudrate(): FAILED(0x%x)", result);
        return  CYBT_ERR_HCI_SET_BAUDRATE_FAILED;
    }
}

cybt_result_t cybt_platform_hci_write(hci_packet_type_t type,
                                                  uint8_t          *p_data,
                                                  uint32_t         length
                                                 )
{
    cy_rslt_t result;
    cybt_result_t return_status =  CYBT_SUCCESS;

    if(false == hci_uart_cb.inited)
    {
        HCIDRV_TRACE_ERROR("hci_write(): UART is NOT initialized");
        return  CYBT_ERR_HCI_NOT_INITIALIZE;
    }

    result = cy_rtos_get_mutex(&hci_uart_cb.tx_atomic, CY_RTOS_NEVER_TIMEOUT);
    if(CY_RSLT_SUCCESS != result)
    {
        HCIDRV_TRACE_ERROR("hci_write(): Get mutex error (0x%x)\n", result);
        return  CYBT_ERR_HCI_GET_TX_MUTEX_FAILED;
    }

    cybt_platform_sleep_lock();
    cybt_platform_assert_bt_wake();

    result = cyhal_uart_write_async(&hci_uart_cb.hal_obj,
                                    (void *) p_data,
                                    (size_t) length
                                   );
    if(CY_RSLT_SUCCESS == result)
    {
        cy_rtos_get_semaphore(&hci_uart_cb.tx_complete, CY_RTOS_NEVER_TIMEOUT, false);
    }
    else
    {
        HCIDRV_TRACE_ERROR("hci_write(): failure (0x%x)\n", result);
        return_status =  CYBT_ERR_HCI_WRITE_FAILED;
    }

    cybt_platform_deassert_bt_wake();
    cybt_platform_sleep_unlock();

    cy_rtos_set_mutex(&hci_uart_cb.tx_atomic);

    return return_status;
}

cybt_result_t cybt_platform_hci_read(hci_packet_type_t type,
                                                uint8_t           *p_data,
                                                uint32_t          *p_length,
                                                uint32_t          timeout_ms
                                               )
{
    uint32_t  req_len = *p_length;
    cy_rslt_t result;
    cybt_result_t return_status;

    if(false == hci_uart_cb.inited)
    {
        HCIDRV_TRACE_ERROR("hci_read(): UART is NOT initialized");
        return  CYBT_ERR_HCI_NOT_INITIALIZE;
    }

    result = cy_rtos_get_mutex(&hci_uart_cb.rx_atomic, timeout_ms);
    if(CY_RSLT_SUCCESS != result)
    {
        HCIDRV_TRACE_ERROR("hci_read(): Get mutex error (0x%x)\n", result);
        return  CYBT_ERR_HCI_GET_RX_MUTEX_FAILED;
    }

    cybt_platform_sleep_lock();

    if(0 < timeout_ms)
    {
        result = cyhal_uart_read_async(&hci_uart_cb.hal_obj,
                                       (void *) p_data,
                                       (size_t) req_len
                                      );
        if(CY_RSLT_SUCCESS == result)
        {
            result = cy_rtos_get_semaphore(&hci_uart_cb.rx_complete,
                                           timeout_ms,
                                           false
                                          );
        }
        else
        {
            HCIDRV_TRACE_ERROR("hci_read(): failure code = 0x%x\n", result);

            cybt_platform_sleep_unlock();
            cy_rtos_set_mutex(&hci_uart_cb.rx_atomic);
            return  CYBT_ERR_HCI_READ_FAILED;
        }

        if(CY_RSLT_SUCCESS == result)
        {
            return_status = CYBT_SUCCESS;
        }
        else
        {
            HCIDRV_TRACE_ERROR("hci_read(): failed (0x%x), read size = %d",
                               result,
                               hci_uart_cb.hal_obj.context.rxBufIdx
                              );

            if(CY_RTOS_TIMEOUT == result)
            {
                return_status =  CYBT_ERR_TIMEOUT;
            }
            else
            {
                return_status =  CYBT_ERR_GENERIC;
            }
            *p_length = hci_uart_cb.hal_obj.context.rxBufIdx;

            cyhal_uart_read_abort(&hci_uart_cb.hal_obj);
        }
    }
    else
    {
        result = cyhal_uart_read(&hci_uart_cb.hal_obj,
                                 (void *) p_data,
                                 (size_t *)p_length
                                );
        if(CY_RSLT_SUCCESS == result)
        {
            return_status = CYBT_SUCCESS;
        }
        else
        {
            return_status =  CYBT_ERR_HCI_READ_FAILED;
        }
    }

    cybt_platform_sleep_unlock();
    cy_rtos_set_mutex(&hci_uart_cb.rx_atomic);

    return return_status;

