Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack-integration/COMPONENT_HCI-UART/freertos/cybt_platform_freertos.c
}

cybt_result_t cybt_platform_hci_close(void)
{
    cyhal_uart_event_t enable_irq_event = (cyhal_uart_event_t)(CYHAL_UART_IRQ_RX_DONE
                                           | CYHAL_UART_IRQ_TX_DONE
                                           | CYHAL_UART_IRQ_RX_NOT_EMPTY
                                          );
    const cybt_platform_config_t *p_bt_platform_cfg = cybt_platform_get_config();
    if(false == hci_uart_cb.inited)
    {
        HCIDRV_TRACE_ERROR("hci_close(): Not inited\n");
        return  CYBT_ERR_HCI_NOT_INITIALIZE;
    }

    cyhal_uart_enable_event(&hci_uart_cb.hal_obj,
                            enable_irq_event,
                            CYHAL_ISR_PRIORITY_DEFAULT,
                            false
                           );
    cyhal_uart_register_callback(&hci_uart_cb.hal_obj,
                                 NULL,
                                 NULL
                                );
    cyhal_uart_free(&hci_uart_cb.hal_obj);

    if((CYBT_SLEEP_MODE_ENABLED == p_bt_platform_cfg->controller_config.sleep_mode.sleep_mode_enabled)
       && (NC != p_bt_platform_cfg->controller_config.sleep_mode.device_wakeup_pin)
       && (NC != p_bt_platform_cfg->controller_config.sleep_mode.host_wakeup_pin)
      )
    {
        cyhal_gpio_enable_event(p_bt_platform_cfg->controller_config.sleep_mode.host_wakeup_pin,
                                CYHAL_GPIO_IRQ_NONE,
                                CYHAL_ISR_PRIORITY_DEFAULT,
                                true
                               );
 #if (CYHAL_API_VERSION >= 2)
        cyhal_gpio_callback_data_t cb_data = { .callback = NULL, .callback_arg = NULL };
        cyhal_gpio_register_callback(p_bt_platform_cfg->controller_config.sleep_mode.host_wakeup_pin,
                                     &cb_data
                                    );
#else
        cyhal_gpio_register_callback(p_bt_platform_cfg->controller_config.sleep_mode.host_wakeup_pin,
                                     NULL,
                                     NULL
                                    );
#endif
    }

    if(NC != p_bt_platform_cfg->controller_config.sleep_mode.device_wakeup_pin)
    {
        cyhal_gpio_free(p_bt_platform_cfg->controller_config.sleep_mode.device_wakeup_pin);
    }

    if(NC != p_bt_platform_cfg->controller_config.sleep_mode.host_wakeup_pin)
    {
        cyhal_gpio_free(p_bt_platform_cfg->controller_config.sleep_mode.host_wakeup_pin);
    }

    cy_rtos_deinit_mutex(&hci_uart_cb.tx_atomic);
    cy_rtos_deinit_mutex(&hci_uart_cb.rx_atomic);
    cy_rtos_deinit_semaphore(&hci_uart_cb.tx_complete);
    cy_rtos_deinit_semaphore(&hci_uart_cb.rx_complete);

    cyhal_gpio_write(p_bt_platform_cfg->controller_config.bt_power_pin,
                     false
                    );
    cyhal_gpio_free(p_bt_platform_cfg->controller_config.bt_power_pin);

    memset(&hci_uart_cb, 0, sizeof(hci_uart_cb_t));

    return  CYBT_SUCCESS;
}

void cybt_platform_hci_irq_rx_data_ind(bool enable)
{
    cyhal_uart_enable_event(&hci_uart_cb.hal_obj,
                            CYHAL_UART_IRQ_RX_NOT_EMPTY,
                            CYHAL_ISR_PRIORITY_DEFAULT,
                            enable
                           );
}

#if( configUSE_TICKLESS_IDLE != 0 )
void cybt_idle_timer_cback(cy_timer_callback_arg_t arg)
{
    cybt_platform_disable_irq();

    if (platform_sleep_lock == true)
    {
        cyhal_syspm_unlock_deepsleep();
        platform_sleep_lock = false;
    }

    cybt_platform_enable_irq();
}

cybt_result_t cybt_send_action_to_sleep_task(sleep_action_t action)
{
    bool is_from_isr = (SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk) != 0;

    cy_rslt_t result = cy_rtos_put_queue(&sleep_timer_task_queue,
                                         (void *)&action,
                                         0,
                                         is_from_isr
                                        );
    UNUSED_VARIABLE(is_from_isr);

    if(CY_RSLT_SUCCESS != result)
    {
        CY_ASSERT(0);
        return CYBT_ERR_SEND_QUEUE_FAILED;
    }

    return CYBT_SUCCESS;
}

void cybt_sleep_timer_task(cy_thread_arg_t arg)
{
    cy_rslt_t result;
    sleep_action_t action = 0;

    while(1)
    {
        result = cy_rtos_get_queue(&sleep_timer_task_queue,
                                   (void *)&action,
                                   CY_RTOS_NEVER_TIMEOUT,
                                   false
                                  );

        if(CY_RSLT_SUCCESS != result)
        {
            MAIN_TRACE_WARNING("sleep_task(): queue error (0x%x)",
                                result
                              );
            continue;
        }

        if (SLEEP_ACT_EXIT_SLEEP_TASK == action)
        {
            cy_rtos_deinit_queue(&sleep_timer_task_queue);
            break;
        }

        switch(action)
        {
            case SLEEP_ACT_START_IDLE_TIMER:
                cy_rtos_start_timer(&platform_sleep_idle_timer,
                                    PLATFORM_SLEEP_IDLE_TIMEOUT_MS
                                   );
                break;
            case SLEEP_ACT_STOP_IDLE_TIMER:
                {
                    bool is_timer_running = false;
                    cy_rslt_t result;

                    result = cy_rtos_is_running_timer(&platform_sleep_idle_timer,
                                                      &is_timer_running
                                                     );
                    if(CY_RSLT_SUCCESS == result && true == is_timer_running)
                    {
                        cy_rtos_stop_timer(&platform_sleep_idle_timer);
                    }
                }
                break;
            default:
                MAIN_TRACE_ERROR("sleep_task(): Unknown action = 0x%x", action);
                break;
        }
    }
    cy_rtos_exit_thread();
}

void cybt_platform_terminate_sleep_thread(void)
{
    cy_rslt_t cy_result;

    cy_result = cy_rtos_join_thread(&sleep_timer_task);
    if(CY_RSLT_SUCCESS != cy_result)
    {
        MAIN_TRACE_ERROR("terminate Sleep thread failed 0x%x\n", cy_result);
    }
}

#endif
